garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1614.PIC
          <edc:SFRDef edc:access="-------n" edc:cname="PID1Z2U" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PID1Z2U" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z216" edc:desc="" edc:mask="0x1" edc:name="PID1Z216" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z216" edc:desc="" edc:mask="0x1" edc:name="Z216" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1ACC" edc:desc="" edc:name="PID1ACC" edc:nzwidth="0x28" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1ACCLL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1ACCLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1ACC0" edc:desc="" edc:mask="0x1" edc:name="PID1ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC1" edc:desc="" edc:mask="0x1" edc:name="PID1ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC2" edc:desc="" edc:mask="0x1" edc:name="PID1ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC3" edc:desc="" edc:mask="0x1" edc:name="PID1ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC4" edc:desc="" edc:mask="0x1" edc:name="PID1ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC5" edc:desc="" edc:mask="0x1" edc:name="PID1ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC6" edc:desc="" edc:mask="0x1" edc:name="PID1ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC7" edc:desc="" edc:mask="0x1" edc:name="PID1ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC0" edc:desc="" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:desc="" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:desc="" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:desc="" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:desc="" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:desc="" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:desc="" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:desc="" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1ACCLH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1ACCLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x610">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1ACC8" edc:desc="" edc:mask="0x1" edc:name="PID1ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC9" edc:desc="" edc:mask="0x1" edc:name="PID1ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC10" edc:desc="" edc:mask="0x1" edc:name="PID1ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC11" edc:desc="" edc:mask="0x1" edc:name="PID1ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC12" edc:desc="" edc:mask="0x1" edc:name="PID1ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC13" edc:desc="" edc:mask="0x1" edc:name="PID1ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC14" edc:desc="" edc:mask="0x1" edc:name="PID1ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC15" edc:desc="" edc:mask="0x1" edc:name="PID1ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC8" edc:desc="" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:desc="" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:desc="" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:desc="" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:desc="" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:desc="" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:desc="" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:desc="" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1ACCHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1ACCHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x611">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1ACC16" edc:desc="" edc:mask="0x1" edc:name="PID1ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC17" edc:desc="" edc:mask="0x1" edc:name="PID1ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC18" edc:desc="" edc:mask="0x1" edc:name="PID1ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC19" edc:desc="" edc:mask="0x1" edc:name="PID1ACC19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC20" edc:desc="" edc:mask="0x1" edc:name="PID1ACC20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC21" edc:desc="" edc:mask="0x1" edc:name="PID1ACC21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC22" edc:desc="" edc:mask="0x1" edc:name="PID1ACC22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC23" edc:desc="" edc:mask="0x1" edc:name="PID1ACC23" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC16" edc:desc="" edc:mask="0x1" edc:name="ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC17" edc:desc="" edc:mask="0x1" edc:name="ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC18" edc:desc="" edc:mask="0x1" edc:name="ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC19" edc:desc="" edc:mask="0x1" edc:name="ACC19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC20" edc:desc="" edc:mask="0x1" edc:name="ACC20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC21" edc:desc="" edc:mask="0x1" edc:name="ACC21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC22" edc:desc="" edc:mask="0x1" edc:name="ACC22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC23" edc:desc="" edc:mask="0x1" edc:name="ACC23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1ACCHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1ACCHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x612">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1ACC24" edc:desc="" edc:mask="0x1" edc:name="PID1ACC24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC25" edc:desc="" edc:mask="0x1" edc:name="PID1ACC25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC26" edc:desc="" edc:mask="0x1" edc:name="PID1ACC26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC27" edc:desc="" edc:mask="0x1" edc:name="PID1ACC27" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC28" edc:desc="" edc:mask="0x1" edc:name="PID1ACC28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC29" edc:desc="" edc:mask="0x1" edc:name="PID1ACC29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC30" edc:desc="" edc:mask="0x1" edc:name="PID1ACC30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC31" edc:desc="" edc:mask="0x1" edc:name="PID1ACC31" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC24" edc:desc="" edc:mask="0x1" edc:name="ACC24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC25" edc:desc="" edc:mask="0x1" edc:name="ACC25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC26" edc:desc="" edc:mask="0x1" edc:name="ACC26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC27" edc:desc="" edc:mask="0x1" edc:name="ACC27" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC28" edc:desc="" edc:mask="0x1" edc:name="ACC28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC29" edc:desc="" edc:mask="0x1" edc:name="ACC29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC30" edc:desc="" edc:mask="0x1" edc:name="ACC30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC31" edc:desc="" edc:mask="0x1" edc:name="ACC31" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-----nnn" edc:cname="PID1ACCU" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PID1ACCU" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x613">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1ACC32" edc:desc="" edc:mask="0x1" edc:name="PID1ACC32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC33" edc:desc="" edc:mask="0x1" edc:name="PID1ACC33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1ACC34" edc:desc="" edc:mask="0x1" edc:name="PID1ACC34" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC32" edc:desc="" edc:mask="0x1" edc:name="ACC32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC33" edc:desc="" edc:mask="0x1" edc:name="ACC33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC34" edc:desc="" edc:mask="0x1" edc:name="ACC34" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nr---nnn" edc:cname="PID1CON" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="PID1CON" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x614">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID1MODE" edc:desc="" edc:mask="0x7" edc:name="PID1MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PID1BUSY" edc:desc="" edc:mask="0x1" edc:name="PID1BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID1EN" edc:desc="" edc:mask="0x1" edc:name="PID1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PID1MODE0" edc:desc="" edc:mask="0x1" edc:name="PID1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID1MODE1" edc:desc="" edc:mask="0x1" edc:name="PID1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID1MODE2" edc:desc="" edc:mask="0x1" edc:name="PID1MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x615"/>
        <edc:JoinedSFRDef edc:cname="PWM3DC" edc:desc="" edc:name="PWM3DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM3DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM3DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM3DC0" edc:desc="" edc:mask="0x1" edc:name="PWM3DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC1" edc:desc="" edc:mask="0x1" edc:name="PWM3DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x618">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3DC2" edc:desc="" edc:mask="0x1" edc:name="PWM3DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC3" edc:desc="" edc:mask="0x1" edc:name="PWM3DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC4" edc:desc="" edc:mask="0x1" edc:name="PWM3DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC5" edc:desc="" edc:mask="0x1" edc:name="PWM3DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC6" edc:desc="" edc:mask="0x1" edc:name="PWM3DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC7" edc:desc="" edc:mask="0x1" edc:name="PWM3DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC8" edc:desc="" edc:mask="0x1" edc:name="PWM3DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC9" edc:desc="" edc:mask="0x1" edc:name="PWM3DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM3CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x619">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM3POL" edc:desc="" edc:mask="0x1" edc:name="PWM3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN" edc:desc="" edc:mask="0x1" edc:name="PWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4DC" edc:desc="" edc:name="PWM4DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM4DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM4DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM4DC0" edc:desc="" edc:mask="0x1" edc:name="PWM4DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC1" edc:desc="" edc:mask="0x1" edc:name="PWM4DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
