garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1614.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1IE1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1IE1" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x819">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AT1CC1IE" edc:desc="" edc:mask="0x1" edc:name="AT1CC1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC2IE" edc:desc="" edc:mask="0x1" edc:name="AT1CC2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC3IE" edc:desc="" edc:mask="0x1" edc:name="AT1CC3IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AT1STPT" edc:desc="" edc:name="AT1STPT" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81A">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1STPTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AT1STPTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1STPT0" edc:desc="" edc:mask="0x1" edc:name="AT1STPT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT1" edc:desc="" edc:mask="0x1" edc:name="AT1STPT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT2" edc:desc="" edc:mask="0x1" edc:name="AT1STPT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT3" edc:desc="" edc:mask="0x1" edc:name="AT1STPT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT4" edc:desc="" edc:mask="0x1" edc:name="AT1STPT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT5" edc:desc="" edc:mask="0x1" edc:name="AT1STPT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT6" edc:desc="" edc:mask="0x1" edc:name="AT1STPT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT7" edc:desc="" edc:mask="0x1" edc:name="AT1STPT7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="STPT0" edc:desc="" edc:mask="0x1" edc:name="STPT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT1" edc:desc="" edc:mask="0x1" edc:name="STPT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT2" edc:desc="" edc:mask="0x1" edc:name="STPT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT3" edc:desc="" edc:mask="0x1" edc:name="STPT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT4" edc:desc="" edc:mask="0x1" edc:name="STPT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT5" edc:desc="" edc:mask="0x1" edc:name="STPT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT6" edc:desc="" edc:mask="0x1" edc:name="STPT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT7" edc:desc="" edc:mask="0x1" edc:name="STPT7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AT1STPTH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="AT1STPTH" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1STPT8" edc:desc="" edc:mask="0x1" edc:name="AT1STPT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT9" edc:desc="" edc:mask="0x1" edc:name="AT1STPT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT10" edc:desc="" edc:mask="0x1" edc:name="AT1STPT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT11" edc:desc="" edc:mask="0x1" edc:name="AT1STPT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT12" edc:desc="" edc:mask="0x1" edc:name="AT1STPT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT13" edc:desc="" edc:mask="0x1" edc:name="AT1STPT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1STPT14" edc:desc="" edc:mask="0x1" edc:name="AT1STPT14" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="STPT8" edc:desc="" edc:mask="0x1" edc:name="STPT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT9" edc:desc="" edc:mask="0x1" edc:name="STPT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT10" edc:desc="" edc:mask="0x1" edc:name="STPT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT11" edc:desc="" edc:mask="0x1" edc:name="STPT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT12" edc:desc="" edc:mask="0x1" edc:name="STPT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT13" edc:desc="" edc:mask="0x1" edc:name="STPT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STPT14" edc:desc="" edc:mask="0x1" edc:name="STPT14" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AT1ERR" edc:desc="" edc:name="AT1ERR" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="AT1ERRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="AT1ERRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1ERR0" edc:desc="" edc:mask="0x1" edc:name="AT1ERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR1" edc:desc="" edc:mask="0x1" edc:name="AT1ERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR2" edc:desc="" edc:mask="0x1" edc:name="AT1ERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR3" edc:desc="" edc:mask="0x1" edc:name="AT1ERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR4" edc:desc="" edc:mask="0x1" edc:name="AT1ERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR5" edc:desc="" edc:mask="0x1" edc:name="AT1ERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR6" edc:desc="" edc:mask="0x1" edc:name="AT1ERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR7" edc:desc="" edc:mask="0x1" edc:name="AT1ERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR0" edc:desc="" edc:mask="0x1" edc:name="ERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR1" edc:desc="" edc:mask="0x1" edc:name="ERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR2" edc:desc="" edc:mask="0x1" edc:name="ERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR3" edc:desc="" edc:mask="0x1" edc:name="ERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR4" edc:desc="" edc:mask="0x1" edc:name="ERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR5" edc:desc="" edc:mask="0x1" edc:name="ERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR6" edc:desc="" edc:mask="0x1" edc:name="ERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR7" edc:desc="" edc:mask="0x1" edc:name="ERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ERRL0" edc:mask="0x1" edc:name="ERRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL1" edc:mask="0x1" edc:name="ERRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL2" edc:mask="0x1" edc:name="ERRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL3" edc:mask="0x1" edc:name="ERRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL4" edc:mask="0x1" edc:name="ERRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL5" edc:mask="0x1" edc:name="ERRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL6" edc:mask="0x1" edc:name="ERRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRL7" edc:mask="0x1" edc:name="ERRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="AT1ERRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="AT1ERRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="2" edc:_begin="0xe" edc:_end="0x12" edc:_addr="0x81D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1ERR8" edc:desc="" edc:mask="0x1" edc:name="AT1ERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR9" edc:desc="" edc:mask="0x1" edc:name="AT1ERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR10" edc:desc="" edc:mask="0x1" edc:name="AT1ERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR11" edc:desc="" edc:mask="0x1" edc:name="AT1ERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR12" edc:desc="" edc:mask="0x1" edc:name="AT1ERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR13" edc:desc="" edc:mask="0x1" edc:name="AT1ERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR14" edc:desc="" edc:mask="0x1" edc:name="AT1ERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1ERR15" edc:desc="" edc:mask="0x1" edc:name="AT1ERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR8" edc:desc="" edc:mask="0x1" edc:name="ERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR9" edc:desc="" edc:mask="0x1" edc:name="ERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR10" edc:desc="" edc:mask="0x1" edc:name="ERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR11" edc:desc="" edc:mask="0x1" edc:name="ERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR12" edc:desc="" edc:mask="0x1" edc:name="ERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR13" edc:desc="" edc:mask="0x1" edc:name="ERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR14" edc:desc="" edc:mask="0x1" edc:name="ERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERR15" edc:desc="" edc:mask="0x1" edc:name="ERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ERRH0" edc:mask="0x1" edc:name="ERRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH1" edc:mask="0x1" edc:name="ERRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH2" edc:mask="0x1" edc:name="ERRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH3" edc:mask="0x1" edc:name="ERRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH4" edc:mask="0x1" edc:name="ERRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH5" edc:mask="0x1" edc:name="ERRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH6" edc:mask="0x1" edc:name="ERRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERRH7" edc:mask="0x1" edc:name="ERRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x81E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
        <edc:SFRDef edc:access="-------n" edc:cname="AT1CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="AT1CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x88C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CS" edc:desc="" edc:mask="0x1" edc:name="AT1CS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AT1CS0" edc:desc="" edc:mask="0x1" edc:name="AT1CS0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1SIG" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1SIG" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x88D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSEL" edc:desc="" edc:mask="0x7" edc:name="SSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AT1SSEL0" edc:desc="" edc:mask="0x1" edc:name="AT1SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1SSEL1" edc:desc="" edc:mask="0x1" edc:name="AT1SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1SSEL2" edc:desc="" edc:mask="0x1" edc:name="AT1SSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="SSEL0" edc:desc="" edc:mask="0x1" edc:name="SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL1" edc:desc="" edc:mask="0x1" edc:name="SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL2" edc:desc="" edc:mask="0x1" edc:name="SSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1SSEL" edc:desc="" edc:mask="0x7" edc:name="AT1SSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1CSEL1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1CSEL1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x88E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CP1S" edc:desc="" edc:mask="0x7" edc:name="CP1S" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AT1CP1S0" edc:desc="" edc:mask="0x1" edc:name="AT1CP1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP1S1" edc:desc="" edc:mask="0x1" edc:name="AT1CP1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP1S2" edc:desc="" edc:mask="0x1" edc:name="AT1CP1S2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CP1S0" edc:desc="" edc:mask="0x1" edc:name="CP1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP1S1" edc:desc="" edc:mask="0x1" edc:name="CP1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP1S2" edc:desc="" edc:mask="0x1" edc:name="CP1S2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CP1S" edc:desc="" edc:mask="0x7" edc:name="AT1CP1S" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AT1CC1" edc:desc="" edc:name="AT1CC1" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x88F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1CC1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AT1CC1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x88F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC10" edc:desc="" edc:mask="0x1" edc:name="AT1CC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC11" edc:desc="" edc:mask="0x1" edc:name="AT1CC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC12" edc:desc="" edc:mask="0x1" edc:name="AT1CC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC13" edc:desc="" edc:mask="0x1" edc:name="AT1CC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC14" edc:desc="" edc:mask="0x1" edc:name="AT1CC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC15" edc:desc="" edc:mask="0x1" edc:name="AT1CC15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC16" edc:desc="" edc:mask="0x1" edc:name="AT1CC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC17" edc:desc="" edc:mask="0x1" edc:name="AT1CC17" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC10" edc:desc="" edc:mask="0x1" edc:name="CC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC11" edc:desc="" edc:mask="0x1" edc:name="CC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC12" edc:desc="" edc:mask="0x1" edc:name="CC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC13" edc:desc="" edc:mask="0x1" edc:name="CC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC14" edc:desc="" edc:mask="0x1" edc:name="CC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC15" edc:desc="" edc:mask="0x1" edc:name="CC15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC16" edc:desc="" edc:mask="0x1" edc:name="CC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC17" edc:desc="" edc:mask="0x1" edc:name="CC17" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="AT1CC1H" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="AT1CC1H" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x890">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC18" edc:desc="" edc:mask="0x1" edc:name="AT1CC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC19" edc:desc="" edc:mask="0x1" edc:name="AT1CC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC18" edc:desc="" edc:mask="0x1" edc:name="CC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC19" edc:desc="" edc:mask="0x1" edc:name="CC19" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
