garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1614.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1CSEL3" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1CSEL3" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x896">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CP3S" edc:desc="" edc:mask="0x7" edc:name="AT1CP3S" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AT1CP3S0" edc:desc="" edc:mask="0x1" edc:name="AT1CP3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP3S1" edc:desc="" edc:mask="0x1" edc:name="AT1CP3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP3S2" edc:desc="" edc:mask="0x1" edc:name="AT1CP3S2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CP3S" edc:desc="" edc:mask="0x7" edc:name="CP3S" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CP3S0" edc:desc="" edc:mask="0x1" edc:name="CP3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP3S1" edc:desc="" edc:mask="0x1" edc:name="CP3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP3S2" edc:desc="" edc:mask="0x1" edc:name="CP3S2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AT1CC3" edc:desc="" edc:name="AT1CC3" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x897">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1CC3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AT1CC3L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x897">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC30" edc:desc="" edc:mask="0x1" edc:name="AT1CC30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC31" edc:desc="" edc:mask="0x1" edc:name="AT1CC31" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC32" edc:desc="" edc:mask="0x1" edc:name="AT1CC32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC33" edc:desc="" edc:mask="0x1" edc:name="AT1CC33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC34" edc:desc="" edc:mask="0x1" edc:name="AT1CC34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC35" edc:desc="" edc:mask="0x1" edc:name="AT1CC35" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC36" edc:desc="" edc:mask="0x1" edc:name="AT1CC36" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC37" edc:desc="" edc:mask="0x1" edc:name="AT1CC37" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC30" edc:desc="" edc:mask="0x1" edc:name="CC30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC31" edc:desc="" edc:mask="0x1" edc:name="CC31" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC32" edc:desc="" edc:mask="0x1" edc:name="CC32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC33" edc:desc="" edc:mask="0x1" edc:name="CC33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC34" edc:desc="" edc:mask="0x1" edc:name="CC34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC35" edc:desc="" edc:mask="0x1" edc:name="CC35" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC36" edc:desc="" edc:mask="0x1" edc:name="CC36" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC37" edc:desc="" edc:mask="0x1" edc:name="CC37" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="AT1CC3H" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="AT1CC3H" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x898">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC38" edc:desc="" edc:mask="0x1" edc:name="AT1CC38" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC39" edc:desc="" edc:mask="0x1" edc:name="AT1CC39" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC38" edc:desc="" edc:mask="0x1" edc:name="CC38" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC39" edc:desc="" edc:mask="0x1" edc:name="CC39" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n--nn--n" edc:cname="AT1CCON3" edc:desc="" edc:impl="0x99" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00--0" edc:name="AT1CCON3" edc:nzwidth="8" edc:por="0--00--0" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x899">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CC3MODE" edc:desc="" edc:mask="0x1" edc:name="AT1CC3MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AT1CAP3P" edc:desc="" edc:mask="0x1" edc:name="AT1CAP3P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC3POL" edc:desc="" edc:mask="0x1" edc:name="AT1CC3POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC3EN" edc:desc="" edc:mask="0x1" edc:name="AT1CC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CC3MODE" edc:desc="" edc:mask="0x1" edc:name="CC3MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CAP3P" edc:desc="" edc:mask="0x1" edc:name="CAP3P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CC3POL" edc:desc="" edc:mask="0x1" edc:name="CC3POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CC3EN" edc:desc="" edc:mask="0x1" edc:name="CC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0x89A"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0xD0C"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdb0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
        <edc:JoinedSFRDef edc:cname="SMT1TMR" edc:desc="" edc:name="SMT1TMR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR0" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR1" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR2" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR3" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR4" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR5" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR6" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR7" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR8" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR9" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR10" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR11" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR12" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR13" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR14" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR15" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR16" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR17" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR18" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR19" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR20" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR21" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR22" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR23" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPR" edc:desc="" edc:name="SMT1CPR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD90">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD91">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SMT1CPR16" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR17" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR18" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR19" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR20" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR21" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR22" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR23" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPW" edc:desc="" edc:name="SMT1CPW" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD92">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD92">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD93">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
